import {
  faFacebookF,
  faInstagram,
  faTwitter,
  faWhatsapp,
} from "@fortawesome/free-brands-svg-icons";
import "@fortawesome/fontawesome-svg-core/styles.css";
import { faPhone } from "@fortawesome/free-solid-svg-icons";

export const NavLinks = [
  {
    id: 1,
    name: "الرئيسية",
    url: "/",
  },
  {
    id: 2,
    name: "خدمات",
    url: "/services",
  },
  {
    id: 3,
    name: "حول شركتنا",
    url: "/about",
  },

  {
    id: 4,
    name: "الاتصال",
    url: "/contact",
  },
];

export const SiteInfo = {
  title: `دهانات
  ديكورات داخليه
 ترميمات
  تشطيبات`,
  description: `ديكورات داخليه
  ترميمات
   تشطيبات
  ديكورات جبسيه وخشبية `,
  fullDescription: `
 ورق جدران بأنواعه
 باركية مقاوم للماء ولخدوش 
 خلفيات شاشات 
 تكسيات بديل_الخشب
 فوم
 شيبورد بألوانه`,
  heroImage: "/images/hero.webp",
  mobileNumber: "00966557009560",
  whatsappNumber: "966533591470",
};

export const ServicesList = [
  {
    id: 1,
    link: "/",
    title: "دهانات",
    image: "/images/dehanat.png",
    description:
      "تُعد الابتكار والاستجابة للتوجهات الحديثة من أهم مميزات دهانات وديكورات صفاء جدة. يشهد قطاع الدهانات تطورات متسارعة، مع ظهور مواد وتقنيات جديدة تتيح تجربة ألوان وتأثيرات لم تكن ممكنة في الماضي. تقدم صفاء جدة مجموعة واسعة من الدهانات التي تناسب كل رغبة وحاجة، من دهانات ذات أساس مائي صديقة للبيئة",
  },
  {
    id: 2,
    link: "/",
    title: "ديكورات داخليه",
    image: "/images/decorat-dakhlyia.jpg",
    description:
      "الديكور الداخلي هو فن تنسيق المساحات الداخلية بطريقة جذابة ووظيفية. يتطلب ذلك الموازنة بين الجمال والعملية، باستخدام الألوان والأثاث والإضاءة بشكل متناغم. النجاح في الديكور الداخلي يكمن في قدرة المصمم على خلق بيئة داخلية مريحة وتعكس شخصية المالك. إن الاهتمام بالتفاصيل الدقيقة هو ما يميز الديكورات الداخلية المتميزة",
  },
  {
    id: 3,
    link: "/",
    title: "ترميمات",
    image: "/images/tarmemat.jpg",
    description:
      "الترميمات الداخلية تتطلب تخطيطًا وتصميمًا دقيقًا لتجديد الأسطح والأثاث والإضاءة. يجب إصلاح أي تلف أو طلاء قديم، واستبدال القطع التالفة بأخرى جديدة. الاهتمام بالتفاصيل الصغيرة كاللمسات النهائية والديكورات هو ما يضفي طابعًا احترافيًا على النتيجة. الحفاظ على نظام التنظيم والتنسيق طوال عملية الترميم أمر بالغ الأهمية",
  },
  {
    id: 4,
    link: "/",
    title: "تشطيبات",
    image: "/images/tashtebat.jpg",
    description:
      "التشطيبات الداخلية تتضمن إنهاء وإكمال كافة العناصر المعمارية والتصميمية للمساحة الداخلية. يشمل ذلك معالجة الأسطح، وتركيب الأرضيات والأبواب والنوافذ، وتوفير الإضاءة والتهوية المناسبة. الاختيار الدقيق للمواد والألوان والتصاميم يلعب دورًا حاسمًا في إنشاء جو داخلي متناسق وجذاب. تتطلب التشطيبات الناجحة الالتزام بالمعايير",
  },
  {
    id: 5,
    link: "/",
    title: "ديكورات جبسيه وخشبية",
    image: "/images/decorate-gebsya.jpg",
    description:
      "الديكورات الجبسية توفر مرونة في التشكيل والتصميم، وتمنح المساحات الداخلية لمسات أنيقة وحديثة. الديكورات الخشبية، من ناحية أخرى، تضفي دفئًا وطابعًا طبيعيًا على الفراغات، وتتميز بجودة عالية وبقاء طويل. هذه الديكورات يمكن استخدامها في تصميم الأسقف والجدران والأثاث بطرق مبتكرة تلبي الأذواق المختلفة",
  },
  {
    id: 6,
    link: "/",
    title: "ورق جدران",
    image: "/images/waraq.jpg",
    description:
      "ورق الجدران يعتبر إضافة مميزة للديكور الداخلي، حيث يوفر تنوعًا هائلاً في الألوان والأنماط والملمس. تركيب ورق الجدران يتطلب دقة واحترافية لضمان النتيجة المرغوبة، ويتيح إمكانية تغيير الأجواء بسهولة مع تطور الأذواق والموضة. توفر أنواع ورق الجدران الحديثة مزايا إضافية كالمقاومة للرطوبة والبهتان وسهولة التنظيف",
  },
  {
    id: 7,
    link: "/",
    title: "باركية مقاوم للماء والخدوش",
    image: "/images/barkee.jpeg",
    description:
      "الباركيه المقاوم للماء والخدوش يعد خيارًا مثاليًا للأرضيات في المناطق الرطبة مثل المطابخ والحمامات. هذا النوع من الباركيه مصنوع من مواد عالية الجودة توفر مقاومة قوية ضد البلل والخدوش، وتضمن عمرًا افتراضيًا طويلاً للأرضيات. تتوفر تصاميم وألوان متنوعة للباركيه المقاوم، لتناسب مختلف أساليب الديكور الداخلي",
  },
  {
    id: 8,
    link: "/",
    title: "خلفيات شاشات",
    image: "/images/khlfyat-shasaht.jpg",
    description:
      "خلفيات الشاشات توفر إمكانية تخصيص وتنسيق المظهر البصري للأجهزة الرقمية كالحواسيب والهواتف الذكية. تشمل هذه الخلفيات طيفًا واسعًا من الصور والرسومات والنماذج المتنوعة، بما يتناسب مع الأذواق والاهتمامات الفردية. استخدام خلفيات الشاشات المناسبة يمكن أن يعزز الطابع الشخصي للأجهزة ويحسن من تجربة المستخدم",
  },
  {
    id: 9,
    link: "/",
    title: "تكسيات بديل الخشب",
    image: "/images/taksyat.jpg",
    description:
      "بديل الخشب الأكثر شعبية هو البلاط الخزفي المصمم ليحاكي مظهر الخشب. يتميز هذا البلاط بقوة ومتانة عالية، مما يجعله مقاومًا للماء والخدوش وسهل التنظيف والصيانة. كما أنه يتوفر بتشكيلة واسعة من التصاميم والألوان لتناسب مختلف أساليب الديكور. وبالمقارنة مع الخشب الحقيقي، فإن البلاط الخزفي هذا يعد خيارًا اقتصاديًا",
  },
  {
    id: 10,
    link: "/",
    title: "فوم",
    image: "/images/foam.jpg",
    description:
      "الفوم هو بديل خشب آخر شائع الاستخدام. يتميز الفوم بأنه خفيف الوزن وسهل التشكيل، مما يجعله مناسبًا لتطبيقات متعددة كالتزيين والعزل الحراري. تتوفر ألواح الفوم بأشكال وأحجام متنوعة، وتتمتع بقدرة عالية على الامتصاص للصوت والحرارة. كما أنها سهلة التركيب وأكثر تكلفة فعالية مقارنةً ببعض بدائل الخشب الأخرى. بفضل هذه المميزات",
  },
  {
    id: 11,
    link: "/",
    title: "الواح شيبورد",
    image: "/images/sheboard.jpg",
    description:
      "ألواح الشيبورد هي بديل آخر للخشب يلقى رواجًا متزايدًا في السوق. هذه الألواح مصنوعة من مواد مركبة، عادة ما تكون الألياف الخشبية والبوليمرات. تتميز ألواح الشيبورد بخفة الوزن ومقاومة الحرارة والرطوبة والتشوه، مما يجعلها خياراً مثالياً للاستخدام في المناطق الرطبة كالحمامات والمطابخ",
  },
];

export const MapShareLinks = [
  {
    id: 1,
    title: "Google",
    url: "https://google.com",
    image: "/images/google_map_white_small.webp",
  },
  {
    id: 2,
    title: "Waze",
    url: "https://waze.com",
    image: "/images/waze_white_small.webp",
  },
  {
    id: 3,
    title: "Moovit",
    url: "https://moovit.com",
    image: "/images/moovit_white_small.webp",
  },
];

export const SocialShareLinks = [
  {
    id: 1,
    title: "Facebook",
    url: "https://facebook.com",

    icon: faFacebookF,
  },
  {
    id: 2,
    title: "Twitter",
    url: "https://twitter.com",
    icon: faTwitter,
  },
  {
    id: 3,
    title: "Instagram",
    url: "https://instagram.com",
    icon: faInstagram,
  },
];

export const ContactInfo = [
  {
    id: 1,
    name: "الواتساب",
    href: `https://wa.me/${SiteInfo.whatsappNumber || SiteInfo.mobileNumber}`,
    icon: faWhatsapp,
    text: `${SiteInfo.whatsappNumber || SiteInfo.mobileNumber}`,
  },
  {
    id: 2,
    name: "الهاتف",
    href: `tel:${SiteInfo.mobileNumber}`,
    icon: faPhone,
    text: `${SiteInfo.mobileNumber}`,
  },
];

export const AboutCompany = [
  {
    id: 1,
    title:
      "لدى شركتنا خبرة واسعة في تقديم حلول متكاملة للديكورات والتشطيبات الداخلية. نقوم بتنفيذ أعمال الدهانات والديكورات الداخلية بأعلى مستويات الجودة والإتقان، مستخدمين أفضل المواد والخامات المتطورة. كما نقدم خدمات ترميم وتجديد للمساحات القديمة، بما في ذلك تركيب ورق الجدران بأنواعه المختلفة وتوفير خيارات البطانات الخشبية والجبسية المتميزة.",
  },
  {
    id: 2,
    title:
      "علاوة على ذلك، تتخصص شركتنا في تقديم حلول مبتكرة للأرضيات، حيث نوفر باركيه مقاوم للماء والخدوش بأشكال وألوان عصرية، إلى جانب تكسيات بديلة الخشب وألواح الشيبورد المتنوعة. هذا بالإضافة إلى خدماتنا في إضافة خلفيات شاشات مميزة ذات طابع فني وجمالي.",
  },
  {
    id: 3,
    title:
      "نفخر بقدرتنا على تطبيق أحدث الاتجاهات والتقنيات في مجال الديكورات الداخلية، من خلال استخدام الفوم والمواد العازلة التي تمنح المساحات داخلية مظهراً أنيقاً وعملياً. وذلك بهدف تحقيق تجربة تشطيب متكاملة ومبهرة لعملائنا.",
  },
];

export const BlogList = [
  {
    id: 1,
    title: "شركة نقل اثاث بالرياض",
    description:
      "تعد شركة نقل عفش بالرياض من الشركات الهامة في المملكة العربية السعودية، وتحديدًا في العاصمة الرياض، حيث توجد العديد من الشركات المتخصصة",
    image: "/images/1.jpeg",
    link: "/",
  },
  {
    id: 2,
    title: "شركة نقل اثاث بالرياض",
    description:
      "تعد شركة نقل عفش بالرياض من الشركات الهامة في المملكة العربية السعودية، وتحديدًا في العاصمة الرياض، حيث توجد العديد من الشركات المتخصصة",
    image: "/images/2.jpeg",
    link: "/",
  },
  {
    id: 3,
    title: "شركة نقل اثاث بالرياض",
    description:
      "تعد شركة نقل عفش بالرياض من الشركات الهامة في المملكة العربية السعودية، وتحديدًا في العاصمة الرياض، حيث توجد العديد من الشركات المتخصصة",
    image: "/images/3.jpeg",
    link: "/",
  },
  {
    id: 4,
    title: "شركة نقل اثاث بالرياض",
    description:
      "تعد شركة نقل عفش بالرياض من الشركات الهامة في المملكة العربية السعودية، وتحديدًا في العاصمة الرياض، حيث توجد العديد من الشركات المتخصصة",
    image: "/images/4.jpeg",
    link: "/",
  },
];
